In [23]:
#Import Libraries panda, numpy and matplotlib.pyplot
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [24]:
bom = pd.read_csv('datauz/bom.movie_gross.csv')
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [25]:
bom.info()
bom.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [26]:
imdbname = pd.read_csv('datauz/imdb.name.basics.csv')
imdbname.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [27]:
imdbname.info()
imdbname.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
nconst                606648 non-null object
primary_name          606648 non-null object
birth_year            82736 non-null float64
death_year            6783 non-null float64
primary_profession    555308 non-null object
known_for_titles      576444 non-null object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

         birth_year   death_year
count  82736.000000  6783.000000
mean    1967.043826  2000.523367
std       22.122190    43.951530
min        1.000000    17.000000
25%     1957.000000  2001.000000
50%     1971.000000  2013.000000
75%     1981.000000  2016.000000
max     2014.000000  2019.000000

In [28]:
#Exploring all the data from IMDB
imdbbasics = pd.read_csv('datauz/imdb.title.basics.csv')
imdbbasics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [29]:
imdbbasics.info()
imdbbasics.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [30]:
imdbprincipals = pd.read_csv('datauz/imdb.title.principals.csv')
imdbprincipals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [31]:
imdbprincipals.info()
imdbprincipals.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

           ordering
count  1.028186e+06
mean   4.739847e+00
std    2.747446e+00
min    1.000000e+00
25%    2.000000e+00
50%    4.000000e+00
75%    7.000000e+00
max    1.000000e+01

In [32]:
imdbcrew = pd.read_csv('datauz/imdb.title.crew.csv')
imdbcrew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [33]:
imdbcrew.info()
imdbcrew.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
tconst       146144 non-null object
directors    140417 non-null object
writers      110261 non-null object
dtypes: object(3)
memory usage: 3.3+ MB

           tconst  directors    writers
count      146144     140417     110261
unique     146144      98525      91920
top     tt4071086  nm3266654  nm0000636
freq            1         62         80

In [34]:
imdbratings = pd.read_csv('datauz/imdb.title.ratings.csv')
imdbratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [35]:
imdbratings.info()
imdbratings.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [36]:
imdbakas = pd.read_csv('datauz/imdb.title.akas.csv')
imdbakas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [37]:
imdbakas.info()
imdbakas.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

            ordering  is_original_title
count  331703.000000      331678.000000
mean        5.125872           0.134769
std         6.706664           0.341477
min         1.000000           0.000000
25%         1.000000           0.000000
50%         2.000000           0.000000
75%         6.000000           0.000000
max        61.000000           1.000000

In [38]:
tmdb = pd.read_csv('datauz/tmdb.movies.csv')
tmdb.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [39]:
tmdb.info()
tmdb.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

In [40]:
#Import tn dataset originally (https://www.the-numbers.com/movie/budgets/all)
tn = pd.read_csv('datauz/tn.movie_budgets.csv')
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [41]:
tn.info()
tn.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [42]:
#converting production_budget, domestic_gross, and worldwide_gross from objects to int values
tn.production_budget = tn.production_budget.replace('[\$,]', '', regex=True).astype(int)
tn.domestic_gross = tn.domestic_gross.replace('[\$,]', '', regex=True).astype(int)
tn.worldwide_gross = tn.worldwide_gross.replace('[\$,]', '', regex=True).astype(int)
tn.release_date = pd.to_datetime(tn.release_date)

In [43]:
tn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null datetime64[ns]
movie                5782 non-null object
production_budget    5782 non-null int64
domestic_gross       5782 non-null int64
worldwide_gross      5782 non-null int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 271.2+ KB

In [44]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,2009-12-18,Avatar,425000000,760507625,2776345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [45]:
#created international_gross variable to assist in seeing success internationally compared to domestically
tn['international_gross'] = tn.worldwide_gross - tn.domestic_gross

In [46]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2015837654
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,107000000
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,944008095
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365

In [47]:
#creted profit variable to show overall success of movie, which is determined by how much profit it made
tn['profit'] = tn.worldwide_gross - tn.production_budget

In [48]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2015837654,2351345279
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000,635063875
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,107000000,-200237650
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,944008095,1072413963
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365,999721747

In [49]:
#sorting tn data set by profit, descending
tn.sort_values(by='profit', ascending=False)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,2015837654,2351345279
42,43,1997-12-19,Titanic,200000000,659363944,2208208395,1548844451,2008208395
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,1369318718,1748134200
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1116648995,1747311220
33,34,2015-06-12,Jurassic World,215000000,652270625,1648854864,996584239,1433854864
...,...,...,...,...,...,...,...,...
352,53,2001-04-27,Town & Country,105000000,6712451,10364769,3652318,-94635231
341,42,2019-06-14,Men in Black: International,110000000,3100000,3100000,0,-106900000
193,94,2011-03-11,Mars Needs Moms,150000000,21392758,39549758,18157000,-110450242
194,95,2020-12-31,Moonfall,150000000,0,0,0,-150000000
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,107000000,-200237650

In [50]:
#created data set of top 100 movies, by profit
tn100 = tn.head(100)

In [51]:
tn100.info()
tn100.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
id                     100 non-null int64
release_date           100 non-null datetime64[ns]
movie                  100 non-null object
production_budget      100 non-null int64
domestic_gross         100 non-null int64
worldwide_gross        100 non-null int64
international_gross    100 non-null int64
profit                 100 non-null int64
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 6.4+ KB

,id,production_budget,domestic_gross,worldwide_gross,international_gross,profit
count,100.000000,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02
mean,50.500000,2.181470e+08,2.770578e+08,7.786893e+08,5.016315e+08,5.605423e+08
std,29.011492,4.847488e+07,1.760181e+08,4.630089e+08,3.158131e+08,4.451096e+08
min,1.000000,1.750000e+08,4.047937e+07,1.497624e+08,1.029343e+08,-2.002376e+08
25%,25.750000,1.850000e+08,1.529428e+08,4.107407e+08,2.638226e+08,2.112311e+08
50%,50.500000,2.000000e+08,2.345667e+08,7.448241e+08,4.710187e+08,5.420640e+08
75%,75.250000,2.300000e+08,3.525447e+08,1.018056e+09,6.442247e+08,7.932507e+08
max,100.000000,4.250000e+08,9.366622e+08,2.776345e+09,2.015838e+09,2.351345e+09

In [52]:
np.mean(tn100['production_budget'])

218147000.0

In [53]:
tnbottom100 = tn.tail(100)

In [54]:
np.mean(tnbottom100['production_budget'])

45188.0

In [55]:
imdbmerge = pd.merge(imdbprincipals, imdbname, on = 'nconst')

In [56]:
imdbmerge.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940"
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181"

In [57]:
imdbfinal = pd.merge(imdbmerge, imdbbasics, on = 'tconst')

In [58]:
imdbfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
3,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
4,tt5573596,4,nm0000476,actress,NaN,NaN,Sally Kirkland,1941.0,NaN,"actress,producer,miscellaneous","tt0315327,tt0092569,tt3216866,tt0102138",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy

In [59]:
imdbfinal = imdbfinal.rename(columns = {'primary_title': 'movie'})

In [60]:
imdbfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,movie,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
3,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
4,tt5573596,4,nm0000476,actress,NaN,NaN,Sally Kirkland,1941.0,NaN,"actress,producer,miscellaneous","tt0315327,tt0092569,tt3216866,tt0102138",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy

In [61]:
#Merging TN dataframe with IMDB merged dataframe
tnfinal = pd.merge(imdbfinal, tn, on = 'movie', how = 'right')

In [62]:
tnfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,...,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,tt1414378,10.0,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director",...,2010.0,102.0,"Action,Adventure,Drama",4,2011-12-31,6500000,0,3149,3149,-6496851
1,tt1414378,1.0,nm0935653,actor,NaN,"[""Arjan van Diemen""]",Ray Winstone,1957.0,NaN,"actor,producer,soundtrack",...,2010.0,102.0,"Action,Adventure,Drama",4,2011-12-31,6500000,0,3149,3149,-6496851
2,tt1414378,8.0,nm0371675,producer,producer,NaN,Trevor Haysom,NaN,NaN,"producer,art_department,assistant_director",...,2010.0,102.0,"Action,Adventure,Drama",4,2011-12-31,6500000,0,3149,3149,-6496851
3,tt1414378,2.0,nm4482049,actor,NaN,"[""Brooke""]",Nicholas McGough,NaN,NaN,actor,...,2010.0,102.0,"Action,Adventure,Drama",4,2011-12-31,6500000,0,3149,3149,-6496851
4,tt1414378,3.0,nm2210329,actor,NaN,"[""Maj. Pritchard Carlysle""]",Gareth Reeves,NaN,NaN,actor,...,2010.0,102.0,"Action,Adventure,Drama",4,2011-12-31,6500000,0,3149,3149,-6496851